protogia/avr-descriptionfiles-4-nim/svd/ATmega162.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU</name>
      <description>CPU Registers</description>
      <baseAddress>0x00000024</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3D</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RESET</name>
        <description>External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.     </description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>INT0</name>
        <description>External Interrupt Request 0</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>INT1</name>
        <description>External Interrupt Request 1</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>INT2</name>
        <description>External Interrupt Request 2</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>PCINT0</name>
        <description>Pin Change Interrupt Request 0</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>PCINT1</name>
        <description>Pin Change Interrupt Request 1</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_CAPT</name>
        <description>Timer/Counter3 Capture Event</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_COMPA</name>
        <description>Timer/Counter3 Compare Match A</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_COMPB</name>
        <description>Timer/Counter3 Compare Match B</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>TIMER3_OVF</name>
        <description>Timer/Counter3 Overflow</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_COMP</name>
        <description>Timer/Counter2 Compare Match</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>TIMER2_OVF</name>
        <description>Timer/Counter2 Overflow</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_CAPT</name>
        <description>Timer/Counter1 Capture Event</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPA</name>
        <description>Timer/Counter1 Compare Match A</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_COMPB</name>
        <description>Timer/Counter Compare Match B</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_OVF</name>
        <description>Timer/Counter1 Overflow</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_COMP</name>
        <description>Timer/Counter0 Compare Match</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_OVF</name>
        <description>Timer/Counter0 Overflow</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>SPI_STC</name>
        <description>SPI Serial Transfer Complete</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>USART0_RXC</name>
        <description>USART0, Rx Complete</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>USART1_RXC</name>
        <description>USART1, Rx Complete</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>USART0_UDRE</name>
        <description>USART0 Data register Empty</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>USART1_UDRE</name>
        <description>USART1, Data register Empty</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>USART0_TXC</name>
        <description>USART0, Tx Complete</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>USART1_TXC</name>
        <description>USART1, Tx Complete</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>EE_RDY</name>
        <description>EEPROM Ready</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>ANA_COMP</name>
        <description>Analog Comparator</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>SPM_RDY</name>
        <description>Store Program Memory Read</description>
        <value>27</value>
      </interrupt>
      <registers>
        <register>
          <name>CLKPR</name>
          <description>Clock prescale register</description>
          <addressOffset>0x3D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKPS</name>
              <description>Clock Prescaler Select Bits</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKPCE</name>
              <description>Clock Prescaler Change Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMCUCR</name>
          <description>Extended MCU Control Register</description>
          <addressOffset>0x32</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC2</name>
              <description>Interrupt Sense Control 2</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRW11</name>
              <description>Wait State Select Bit 1 for Upper Sector</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRW0</name>
              <description>Wait State Select Bit 1 for Lower Sector</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_WAIT_STATES</name>
                  <description>No wait-states</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_ONE_CYCLE_DURING_READ_WRITE_STROBE</name>
                  <description>Wait one cycle during read/write strobe</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_TWO_CYCLES_DURING_READ_WRITE_STROBE</name>
                  <description>Wait two cycles during read/write strobe</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_TWO_CYCLES_DURING_READ_WRITE_AND_WAIT_ONE_CYCLE_BEFORE_DRIVING_OUT_NEW_ADDRESS</name>
                  <description>Wait two cycles during read/write and wait one cycle before driving out new address</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRL</name>
              <description>Wait State Sector Limit Bits</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LS_N_A_US_0X1100_0XFFFF</name>
                  <description>LS = N/A, US = 0x1100 - 0xFFFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X1100_0X1FFF_US_0X2000_0XFFFF</name>
                  <description>LS = 0x1100 - 0x1FFF, US = 0x2000 - 0xFFFF</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X1100_0X3FFF_US_0X4000_0XFFFF</name>
                  <description>LS = 0x1100 - 0x3FFF, US = 0x4000 - 0xFFFF</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X1100_0X5FFF_US_0X6000_0XFFFF</name>
                  <description>LS = 0x1100 - 0x5FFF, US = 0x6000 - 0xFFFF</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X1100_0X7FFF_US_0X8000_0XFFFF</name>
                  <description>LS = 0x1100 - 0x7FFF, US = 0x8000 - 0xFFFF</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X1100_0X9FFF_US_0XA000_0XFFFF</name>
                  <description>LS = 0x1100 - 0x9FFF, US = 0xA000 - 0xFFFF</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X1100_0XBFFF_US_0XC000_0XFFFF</name>
                  <description>LS = 0x1100 - 0xBFFF, US = 0xC000 - 0xFFFF</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_0X1100_0XDFFF_US_0XE000_0XFFFF</name>
                  <description>LS = 0x1100 - 0xDFFF, US = 0xE000 - 0xFFFF</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM0</name>
              <description>Sleep mode Select Bit 0</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x31</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC0</name>
              <description>Interrupt Sense Control 0 bits</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_IN_INTX</name>
                  <description>Any Logical Change in INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC1</name>
              <description>Interrupt Sense Control 1 bits</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_IN_INTX</name>
                  <description>Any Logical Change in INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM1</name>
              <description>Sleep Mode Select</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SE</name>
              <description>Sleep Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRW10</name>
              <description>External SRAM Wait State Select</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRE</name>
              <description>External SRAM Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUCSR</name>
          <description>MCU Control And Status Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PORF</name>
              <description>Power-on reset flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTRF</name>
              <description>External Reset Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BORF</name>
              <description>Brown-out Reset Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDRF</name>
              <description>Watchdog Reset Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>JTRF</name>
              <description>JTAG Reset Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SM2</name>
              <description>Sleep Mode Select Bit 2</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>JTD</name>
              <description>JTAG Interface Disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCAL</name>
          <description>Oscillator Calibration Value</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OSCCAL</name>
              <description>Oscillator Calibration </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SFIOR</name>
          <description>Special Function IO Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSR310</name>
              <description>Prescaler Reset Timer/Counter3, Timer/Counter1 and Timer/Counter0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PSR2</name>
              <description>Prescaler Reset Timer/Counter2</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PUD</name>
              <description>Pull-up Disable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XMM</name>
              <description>External Memory High Mask Bits</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>XMBK</name>
              <description>External Memory Bus Keeper Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM</name>
              <description>Timer/Counter Synchronization Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
