protogia/avr-descriptionfiles-4-nim/svd/ATmega162.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EEPROM</name>
      <description>EEPROM</description>
      <baseAddress>0x0000003C</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EEAR</name>
          <description>EEPROM Address Register Bytes</description>
          <addressOffset>0x2</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EEAR</name>
              <description>EEPROM Address Register bits</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>511</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EECR</name>
          <description>EEPROM Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EERE</name>
              <description>EEPROM Read Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEWE</name>
              <description>EEPROM Write Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEMWE</name>
              <description>EEPROM Master Write Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EERIE</name>
              <description>EEPROM Ready Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EEDR</name>
          <description>EEPROM Data Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EEDR</name>
              <description>EEPROM Data Register bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EXINT</name>
      <description>External Interrupts</description>
      <baseAddress>0x00000055</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x5</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x16</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EMCUCR</name>
          <description>Extended MCU Control Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC2</name>
              <description>Interrupt Sense Control 2</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GICR</name>
          <description>General Interrupt Control Register</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IVCE</name>
              <description>Interrupt Vector Change Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IVSEL</name>
              <description>Interrupt Vector Select</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCIE</name>
              <description>Pin Change Interrupt Enables</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INT2</name>
              <description>External Interrupt Request 2 Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INT0</name>
              <description>External Interrupt Request 0 Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INT1</name>
              <description>External Interrupt Request 1 Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GIFR</name>
          <description>General Interrupt Flag Register</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCIF</name>
              <description>Pin Change Interrupt Flags</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>INTF2</name>
              <description>External Interrupt Flag 2</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTF</name>
              <description>External Interrupt Flags</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC0</name>
              <description>Interrupt Sense Control 0 Bits</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC1</name>
              <description>Interrupt Sense Control 1 Bits</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_LEVEL_OF_INTX</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_LOGICAL_CHANGE_OF_INTX</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE_OF_INTX</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING_EDGE_OF_INTX</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCMSK0</name>
          <description>Pin Change Enable Mask</description>
          <addressOffset>0x16</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCINT</name>
              <description>Pin Change Interrupt mask bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCMSK1</name>
          <description>Pin Change Mask Register 1</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCINT</name>
              <description>Pin Change Interrupt mask bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
