protogia/avr-descriptionfiles-4-nim/svd/ATmega162.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>JTAG</name>
      <description>JTAG Interface</description>
      <baseAddress>0x00000024</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MCUCSR</name>
          <description>MCU Control And Status Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>JTRF</name>
              <description>JTAG Reset Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>JTD</name>
              <description>JTAG Interface Disable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCDR</name>
          <description>On-Chip Debug Related Register in I/O Memory</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCDR</name>
              <description>On-Chip Debug Register Bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LOCKBIT</name>
      <description>Lockbits</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LOCKBIT</name>
          <description>No Description.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LB</name>
              <description>Memory Lock</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROG_VER_DISABLED</name>
                  <description>Further programming and verification disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_DISABLED</name>
                  <description>Further programming disabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_LOCK</name>
                  <description>No memory lock features enabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLB0</name>
              <description>Boot Loader Protection Mode</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_SPM_DISABLE</name>
                  <description>LPM and SPM prohibited in Application Section</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DISABLE</name>
                  <description>LPM prohibited in Application Section</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPM_DISABLE</name>
                  <description>SPM prohibited in Application Section</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_LOCK</name>
                  <description>No lock on SPM and LPM in Application Section</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLB1</name>
              <description>Boot Loader Protection Mode</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_SPM_DISABLE</name>
                  <description>LPM and SPM prohibited in Boot Section</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DISABLE</name>
                  <description>LPM prohibited in Boot Section</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPM_DISABLE</name>
                  <description>SPM prohibited in Boot Section</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_LOCK</name>
                  <description>No lock on SPM and LPM in Boot Section</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
